{
    "format": "layers-model",
    "generatedBy": "keras v3.15.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.15.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batchInputShape": [
                                null,
                                45,
                                126
                            ],
                            "batch_shape": [
                                null,
                                45,
                                126
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_layer",
                            "optional": false
                        }
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "return_sequences": true,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "zero_output_for_mask": false,
                            "units": 64,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "input_axes": null,
                                    "output_axes": null
                                },
                                "registered_name": null
                            },
                            "recurrent_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Orthogonal",
                                "config": {
                                    "seed": null,
                                    "gain": 1.0
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.3,
                            "recurrent_dropout": 0.0,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "return_sequences": false,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "zero_output_for_mask": false,
                            "units": 32,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "input_axes": null,
                                    "output_axes": null
                                },
                                "registered_name": null
                            },
                            "recurrent_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Orthogonal",
                                "config": {
                                    "seed": null,
                                    "gain": 1.0
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.3,
                            "recurrent_dropout": 0.0,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "input_axes": null,
                                    "output_axes": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "quantization_config": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.3,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 10,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "input_axes": null,
                                    "output_axes": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "quantization_config": null
                        }
                    }
                ],
                "build_input_shape": [
                    null,
                    45,
                    126
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "loss_weights": null,
            "metrics": [
                "accuracy"
            ],
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": false,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "adam",
                    "learning_rate": 0.0010000000474974513,
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "loss_scale_factor": null,
                    "gradient_accumulation_steps": null,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense/kernel",
                    "shape": [
                        32,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [
                        64,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm/lstm_cell/kernel",
                    "shape": [
                        126,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm/lstm_cell/recurrent_kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm/lstm_cell/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_1/lstm_cell/kernel",
                    "shape": [
                        64,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_1/lstm_cell/recurrent_kernel",
                    "shape": [
                        32,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_1/lstm_cell/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}